tutorials/combustion/XiDyMFoam/oscillatingCylinder/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    "(walls|cylinder)"
    {
        type            epsilonWallFunction;
        value           uniform 100;
    }

    "inlet.*"
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           uniform 100;
    }

    outlet
    {
        type           inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
